Конфигурация/Documents/ЗакрытиеБухгалтерскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗакрытиеБухгалтерскихСчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииСрочныхКонтрактов</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрываемыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗакрытияБухгалтерскихСчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыЗакрытияБухгалтерскихСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВариантыЗакрытияБухгалтерскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыЗакрытияБухгалтерскихСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета91</Name>
					<Comment>Дт 91.9 - Кт 99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета90</Name>
					<Comment>Дт 90.9 - Кт 99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов911и912</Name>
					<Comment>Дт 91.1 - Кт 91.9, Дт 91.2 - Кт 91.9</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчетов901и902</Name>
					<Comment>Дт 90.1 - Кт 90.9, Дт 90.2 - Кт 90.9</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета99</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСЗакрытиеРаздела7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСПереносКорректировокНаПереоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСПереносНачисленныхКорректировокНаПереоценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕПСЗакрытиеРаздела7ВОплаченнойЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета863</Name>
					<Comment>Д 86.3.3 - К 86.3.1, Д 86.3.2 - К 86.3.3 </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеСчета79</Name>
					<Comment>используется только при расторжении договора</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗакрытиеБухгалтерскихСчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	Элементы.ЗакрываемыеСчетаВариантЗакрытияБухгалтерскихСчетов.СписокВыбора.ЗагрузитьЗначения(СписокВыбораВарианта(Объект.ВидУчета, Объект.СчетДоверительногоУправления, Объект.ОкончаниеПериода)); 

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияПриИзменении(Объект.СчетДоверительногоУправления, ЭтаФорма);
	Элементы.ЗакрываемыеСчетаВариантЗакрытияБухгалтерскихСчетов.СписокВыбора.ЗагрузитьЗначения(СписокВыбораВарианта(Объект.ВидУчета, Объект.СчетДоверительногоУправления, Объект.ОкончаниеПериода)); 

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)

	Элементы.ЗакрываемыеСчетаВариантЗакрытияБухгалтерскихСчетов.СписокВыбора.ЗагрузитьЗначения(СписокВыбораВарианта(Объект.ВидУчета, Объект.СчетДоверительногоУправления, НачалоДня(Объект.Дата))); 

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	
	Элементы.ЗакрываемыеСчетаВариантЗакрытияБухгалтерскихСчетов.СписокВыбора.ЗагрузитьЗначения(СписокВыбораВарианта(Объект.ВидУчета, Объект.СчетДоверительногоУправления, Объект.ОкончаниеПериода)); 
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста 
Функция СписокВыбораВарианта(ВидУчета, СчетДУ, ДатаОкончаниеПериода)
	
	Список = Новый Массив;
	
	Если ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет") Тогда 
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСЗакрытиеРаздела7"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСПереносКорректировокНаПереоценки"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСПереносНачисленныхКорректировокНаПереоценки"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЕПСЗакрытиеРаздела7ВОплаченнойЧасти"));
	ИначеЕсли ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.БухгалтерскийУчет") ИЛИ
		ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.НалоговыйУчет")  Тогда 
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета91"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета90"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчетов911и912"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчетов901и902"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета99"));		
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета863"));
		
		// только для расторжения
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДУ, "ДатаРасторжения") = ДатаОкончаниеПериода Тогда 
			Список.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыЗакрытияБухгалтерскихСчетов.ЗакрытиеСчета79"));
		КонецЕсли;		
	КонецЕсли;	
		
	Возврат Список;
		
КонецФункции	


#КонецОбласти
